app/views/quotes/_form.html.erb

SELECT "philosophers".* FROM "philosophers"
---
  <div class="form-group" style="padding-bottom: 10px;">
  <%= form.select :philosopher_id, Philosopher.all.collect { |phil| ["#{phil.fname} #{phil.lname}".strip, phil.id] }, { include_blank: 'Anonymous' }, class: "form-control" %>

SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 14
---
    <!-- Loops through each of the quote's categories -->
    <% @quote.quote_categories.each do |quote_category| %>

SELECT "categories".* FROM "categories"
---
            <%= qc.label :category_id, "Category", class: "form-label d-incline-block me-2" %>
            <%= qc.select :category_id, Category.all.collect { |cat| [cat.cat_name, cat.id] }, { include_blank: true }, class: "form-label d-incline-block" %>