app/views/quotes/_quote.html.erb

    <div class="d-flex flex-wrap"> <!-- Bootstrap horizontal flex wrap -->
      <% quote.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 17

    <label class="form-label"><strong>Philosopher:</strong></label>
      <div><% if quote.philosopher.present? %> <!-- If a user has not selected 'Anonymous' -->
        <!-- Philosopher's name -->
        <% if quote.philosopher.lname.present? %>
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 2 LIMIT 1
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 4 LIMIT 1