app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC LIMIT 10
---
  def index # Method that only displays public quotes. Limited to the 10 most recently added quotes
    @quotes = Quote.where(is_public: true).order(created_at: :desc).limit(10)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = 2
---
  def uquotes # Method that gets all the quotes associated with a user
    @quotes = Quote.where(user_id: session[:user_id])