app/controllers/quotes_controller.rb

  def edit
    (8 - @quote.quote_categories.size).times { @quote.quote_categories.build }
---
SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 16
SELECT COUNT(*) FROM "quote_categories" WHERE "quote_categories"."quote_id" = 17

  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save
        format.html { redirect_to @quote, notice: "Quote was successfully created." }
        format.json { render :show, status: :created, location: @quote }
      else
        # Rebuilds the eight category fields if validation error occurs
        (8 - @quote.quote_categories.size).times { @quote.quote_categories.build }
---
INSERT INTO "quotes" ("quote_text", "pub_year", "user_comment", "is_public", "user_id", "philosopher_id", "created_at", "updated_at") VALUES ('ddasdsdad', 'Unknown', 'asdsdsad', 1, 6, NULL, '2025-10-16 16:22:19.810476', '2025-10-16 16:22:19.810476') RETURNING "id"
SELECT "categories".* FROM "categories"

  def update
    respond_to do |format|
      if @quote.update(quote_params)
        format.html { redirect_to @quote, notice: "Quote was successfully updated.", status: :see_other }
        format.json { render :show, status: :ok, location: @quote }
      else
        @quote.quote_categories.reload
        (8 - @quote.quote_categories.size).times { @quote.quote_categories.build }
---
UPDATE "quotes" SET "quote_text" = 'to be or not to be!!!', "pub_year" = '80 BC', "user_comment" = 'example edit', "philosopher_id" = 4, "updated_at" = '2025-10-18 14:06:46.086452' WHERE "quotes"."id" = 13
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 1 LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = 14

  def destroy
    # Authorisation check so that only the quote's creator or an admin can delete the quote
    unless @quote.user.id == current_user.id || is_administrator?
      redirect_to @quote, alert: "You are not authorised to access this resource"
      return
    end
    @quote.destroy!
---
DELETE FROM "quotes" WHERE "quotes"."id" = 21

    def set_quote
      @quote = Quote.find(params.expect(:id))
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = 9 LIMIT 1