app/controllers/search_controller.rb

SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "quote_categories" "quote_categories_quotes_join" ON "quote_categories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories_quotes_join"."category_id" WHERE (categories.cat_name LIKE '%Logic') AND "quotes"."is_public" = 1
---
  def index
    # Grabs the category searched by the user
    category_query = params[:category_query]
      # Read operation that returns associated quotes with the category searched
      # Added a filter so only public quotes are viewable
      if category_query.present?
        @quotematch = Quote.joins(:quote_categories, :categories). where("categories.cat_name LIKE ?", "%#{category_query}%").where(is_public: true).distinct