app/controllers/users_controller.rb

  def index
    # @users = User.all
    # If an admin is logging in, get all of the users from the db
    if logged_in? && is_administrator?
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES ('Miles', 'Halpine', 'example@gmail.com', '$2a$12$Sk81lTqw2E/VGyrHfkLsL.u0GllRFgE8rNdGlqWqrUF8hKUqKSbDi', 0, 'Active', '2025-10-14 16:14:50.600524', '2025-10-14 16:14:50.600524') RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "fname" = 'Hiles', "lname" = 'Malpine', "email" = 'example@gmail.com', "password_digest" = '$2a$12$Jib31sZVwozoQosl7JWNcuOF.BroSfWfaLakt.BcnfpnDg2jCoNiu', "updated_at" = '2025-10-18 17:32:50.777007' WHERE "users"."id" = 3